app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."active" = 't' AND (product_type_id IN (1,2,3))
SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = 1 AND (variants.deleted_at IS NULL) LIMIT 1
SELECT "product_types".* FROM "product_types" WHERE "product_types"."id" IS NULL LIMIT 1
---
  def index
    products = Product.active.includes(:variants)
    product_type = ProductType.find_by_id(params[:product_type_id])

SELECT "products".* FROM "products" WHERE (products.name LIKE '%polo%' OR products.meta_keywords LIKE '%polo%') AND (products.deleted_at IS NULL OR products.deleted_at > '2012-07-24 02:47:56.389793') LIMIT 15 OFFSET 0
---
  def create

    pagination_args = {}
    pagination_args[:page] = params[:page] || 1
    pagination_args[:rows] = params[:rows] || 15

    if params[:q] && params[:q].present?
      @products = Product.standard_search(params[:q], pagination_args).results
    else
      @products = Product.where('deleted_at IS NULL OR deleted_at > ?', Time.zone.now )

SELECT "products".* FROM "products" WHERE "products"."active" = 't' AND "products"."id" = ? LIMIT 1  [["id", "land"]]
---
  def show
    @product = Product.active.find(params[:id])