app/controllers/admin/merchandise/product_types_controller.rb

  def index
    params[:page] ||= 1
    @product_types = ProductType.admin_grid(params).order(sort_column + " " + sort_direction).
                                              paginate(:per_page => 25, :page => params[:page].to_i)
---
SELECT "product_types".* FROM "product_types" ORDER BY name asc LIMIT 25 OFFSET 0

  def create
    @product_type = ProductType.new(params[:product_type])

    if @product_type.save
---
INSERT INTO "product_types" ("active", "lft", "name", "parent_id", "rgt") VALUES (?, ?, ?, ?, ?)  [["active", true], ["lft", 7], ["name", "Jewelry"], ["parent_id", nil], ["rgt", 8]]

  def edit
    @product_type = ProductType.find(params[:id])
---
SELECT "product_types".* FROM "product_types" WHERE "product_types"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @product_type = ProductType.find(params[:id])
---
SELECT "product_types".* FROM "product_types" WHERE "product_types"."id" = ? LIMIT 1  [["id", "4"]]

  def destroy
    @product_type = ProductType.find(params[:id])
    @product_type.active = false
    @product_type.destroy
---
SELECT "product_types".* FROM "product_types" WHERE "product_types"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "product_types" WHERE "product_types"."id" = ?  [["id", 5]]